src/Reports/ОтчетПоВремениИзготовленияНаЛинейках/ОтчетПоВремениИзготовленияНаЛинейках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоВремениИзготовленияНаЛинейках</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ВычестьНерабочееВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КолНерабочихЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БезВыходных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/ЭтапыПроизводственныхЗаданий/ЭтапыПроизводственныхЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭтапыПроизводственныхЗаданий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </resources>
  <resources>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Ремонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЛьготнаяОчередь/ЛьготнаяОчередь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛьготнаяОчередь</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НормаРасходов</name>
    <type>
      <types>CatalogRef.НормыРасходов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/РемонтнаяКарта/РемонтнаяКарта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РемонтнаяКарта</name>
  <basedOn>Document.ПроизводственноеЗадание</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.ВыпускПродукцииКанбан</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРемонта</name>
    <type>
      <types>EnumRef.ВидыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНеремонтопригодных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подтверждено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаРемонта</name>
    <type>
      <types>CatalogRef.ПричиныРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМестоРазукомплектовки</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиПоступленийСписанийПрочих</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтложен</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСписания</name>
    <type>
      <types>DocumentRef.СписаниеМПЗПрочее</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Неисправности</name>
    <attributes>
      <name>ПозицияНеисправногоМПЗ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеисправныйМПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПозицияМестаНахожденияБрака</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоНахожденияБрака</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапЖизненногоЦикла</name>
      <type>
        <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидБрака</name>
      <type>
        <types>CatalogRef.ВидыБрака</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаменяемыеЭлементы</name>
    <attributes>
      <name>НормаРасхода</name>
      <type>
        <types>CatalogRef.АналогиНормРасходов</types>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ДвижениеМПЗ</types>
        <types>DocumentRef.СписаниеМПЗПрочее</types>
        <types>DocumentRef.МаршрутнаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Разукомплектовка</name>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.МаршрутнаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Reports/ОтчетПоВремениИзготовленияНаЛинейках/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Размерность = 1;
КонецПроцедуры

&НаСервере
Функция БылРемонт(ПЗ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РемонтнаяКарта.Ссылка
	|ИЗ
	|	Документ.РемонтнаяКарта КАК РемонтнаяКарта
	|ГДЕ
	|	РемонтнаяКарта.ДокументОснование = &ДокументОснование";
Запрос.УстановитьПараметр("ДокументОснование", ПЗ);
РезультатЗапроса = Запрос.Выполнить();
Возврат(Не РезультатЗапроса.Пустой());
КонецФункции 

&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();

ТаблицаМПЗ = Новый ТаблицаЗначений;

ТаблицаМПЗ.Колонки.Добавить("ПЗ",Новый ОписаниеТипов("ДокументСсылка.ПроизводственноеЗадание"));
ТаблицаМПЗ.Колонки.Добавить("Изделие",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
ТаблицаМПЗ.Колонки.Добавить("ДатаОт",Новый ОписаниеТипов("Дата"));
ТаблицаМПЗ.Колонки.Добавить("ДатаДо",Новый ОписаниеТипов("Дата"));
ТаблицаМПЗ.Колонки.Добавить("ВремяПростоя",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(9,2)));
ТаблицаМПЗ.Колонки.Добавить("ВремяИзготовления",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(9,2)));
ТаблицаМПЗ.Колонки.Добавить("ПричиныЗадержки",Новый ОписаниеТипов("Строка"));
ТаблицаМПЗ.Колонки.Добавить("МПЗВЛО",Новый ОписаниеТипов("Строка"));

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблЛинейка = Макет.ПолучитьОбласть("Линейка");
ОблИтогоЛинейка = Макет.ПолучитьОбласть("ИтогоЛинейка");
ОблНоменклатура = Макет.ПолучитьОбласть("Номенклатура");
ОблИтогоНоменклатура = Макет.ПолучитьОбласть("ИтогоНоменклатура");
ОблПЗ = Макет.ПолучитьОбласть("ПЗ");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);

ЗапросПЗ = Новый Запрос;
Запрос = Новый Запрос;

ЗапросПЗ.Текст = 
	"ВЫБРАТЬ
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.Изделие КАК Изделие,
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ КАК ПЗ,
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.Линейка КАК Линейка,
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ДатаОкончания,
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.Изделие.Родитель.Наименование КАК Наименование
	|ИЗ
	|	РегистрСведений.ЭтапыПроизводственныхЗаданий.СрезПоследних(, ) КАК ЭтапыПроизводственныхЗаданийСрезПоследних
	|ГДЕ
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И ЭтапыПроизводственныхЗаданийСрезПоследних.ДатаОкончания МЕЖДУ &ДатаНач И &ДатаКон";	
	Если СписокНоменклатуры.Количество() > 0 Тогда
	ЗапросПЗ.Текст = ЗапросПЗ.Текст + " И ЭтапыПроизводственныхЗаданийСрезПоследних.Изделие В ИЕРАРХИИ(&СписокНоменклатуры)";
	ЗапросПЗ.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
	КонецЕсли;
		Если ТолькоСлужебные Тогда
		ЗапросПЗ.Текст = ЗапросПЗ.Текст + " И ЭтапыПроизводственныхЗаданийСрезПоследних.Изделие.Канбан.Служебный = ИСТИНА";
		КонецЕсли; 
			Если ГруппироватьПо = 1 Тогда
			ЗапросПЗ.Текст = ЗапросПЗ.Текст + " УПОРЯДОЧИТЬ ПО Линейка 
												|ИТОГИ ПО Линейка";
			Иначе
			ЗапросПЗ.Текст = ЗапросПЗ.Текст + " УПОРЯДОЧИТЬ ПО Наименование 
												|ИТОГИ ПО Наименование";
			КонецЕсли; 
ЗапросПЗ.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.Период.ДатаНачала));
ЗапросПЗ.УстановитьПараметр("ДатаКон",КонецДня(Отчет.Период.ДатаОкончания));
ЗапросПЗ.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
Результат = ЗапросПЗ.Выполнить();
ВыборкаГруппировки = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаГруппировки.Следующий() Цикл
	ТаблицаМПЗ.Очистить();
		Если ГруппироватьПо = 1 Тогда
		ОблЛинейка.Параметры.Линейка = ВыборкаГруппировки.Линейка;
		ОблЛинейка.Параметры.Комментарий = СокрЛП(ВыборкаГруппировки.Линейка.Комментарий);
		ТабДок.Вывести(ОблЛинейка);
		Иначе
		ОблНоменклатура.Параметры.Наименование = ВыборкаГруппировки.Наименование;
		ТабДок.Вывести(ОблНоменклатура);
		КонецЕсли; 
	ТабДок.НачатьГруппуСтрок("По линейкам", Истина);
	ВыборкаПЗ = ВыборкаГруппировки.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаПЗ.Следующий() Цикл
		ПричиныЗадержки = "";
		МПЗВЛО = "";
		ЭПЗ = РегистрыСведений.ЭтапыПроизводственныхЗаданий.ПолучитьПервое(,Новый Структура("ПЗ",ВыборкаПЗ.ПЗ));
			Если ЗначениеЗаполнено(ВыборкаПЗ.ПЗ.ДокументОснование.ДатаОкончанияОстановки) Тогда
			ПричиныЗадержки = ПричиныЗадержки + "О; ";
			КонецЕсли; 
		флЛО = Ложь;   
		ЛО = РегистрыСведений.ЛьготнаяОчередь.Выбрать(,,Новый Структура("ПЗ",ВыборкаПЗ.ПЗ));
			Пока ЛО.Следующий() Цикл
			флЛО = Истина;
				Если ((ЛО.ДатаОкончания - ЛО.Период)/86400) > 1 Тогда
				МПЗВЛО = МПЗВЛО + СокрЛП(ЛО.НормаРасходов.Элемент.Наименование) + "; ";				
				КонецЕсли;	
			КонецЦикла;
				Если флЛО Тогда
				ПричиныЗадержки = ПричиныЗадержки + "ЛО; ";	
				КонецЕсли;
					Если БылРемонт(ВыборкаПЗ.ПЗ) Тогда				
					ПричиныЗадержки = ПричиныЗадержки + "Р; ";	
					КонецЕсли;
						Если ВыборкаПЗ.ПЗ.ДокументОснование.Остановки.Количество() > 0 Тогда				
						ПричиныЗадержки = ПричиныЗадержки + "О; ";	
						КонецЕсли; 
		ТЧ = ТаблицаМПЗ.Добавить();
		ТЧ.ПЗ = ВыборкаПЗ.ПЗ;
		ТЧ.Изделие = ВыборкаПЗ.Изделие;
		ТЧ.ДатаОт = ЭПЗ.ДатаНачала;
		ТЧ.ДатаДо = ВыборкаПЗ.ДатаОкончания;
		ТЧ.ВремяПростоя = ОбщийМодульВызовСервера.ПолучитьВремяМеждуДатами(ВыборкаПЗ.ПЗ.Дата,ЭПЗ.ДатаНачала,Размерность,Отчет.ВычестьНерабочееВремя,Отчет.КолНерабочихЧасов,Отчет.БезВыходных);
		ТЧ.ВремяИзготовления = ОбщийМодульВызовСервера.ПолучитьВремяМеждуДатами(ЭПЗ.ДатаНачала,ВыборкаПЗ.ДатаОкончания,Размерность,Отчет.ВычестьНерабочееВремя,Отчет.КолНерабочихЧасов,Отчет.БезВыходных);
		ТЧ.ПричиныЗадержки = ПричиныЗадержки; 
		ТЧ.МПЗВЛО = МПЗВЛО;		
		КонецЦикла;
			Если СортироватьПо = 1 Тогда
			ТаблицаМПЗ.Сортировать("Изделие,ВремяИзготовления");
			ИначеЕсли СортироватьПо = 2 Тогда
			ТаблицаМПЗ.Сортировать("ВремяИзготовления Убыв");
			ИначеЕсли СортироватьПо = 3 Тогда
			ТаблицаМПЗ.Сортировать("ВремяИзготовления");
			КонецЕсли; 
				Для каждого ТЧ Из ТаблицаМПЗ Цикл
				ОблПЗ.Параметры.Наименование = СокрЛП(ТЧ.Изделие.Наименование);
				ОблПЗ.Параметры.Изделие = ТЧ.Изделие;
				ОблПЗ.Параметры.НаименованиеТовара = СокрЛП(ТЧ.Изделие.Товар.Наименование);
				ОблПЗ.Параметры.Товар = ТЧ.Изделие.Товар;
				ОблПЗ.Параметры.НомерПЗ = ТЧ.ПЗ.Номер;
				ОблПЗ.Параметры.ПЗ = ТЧ.ПЗ;
				ОблПЗ.Параметры.Количество = ТЧ.ПЗ.Количество;
				ОблПЗ.Параметры.ДатаОт = ТЧ.ДатаОт;
				ОблПЗ.Параметры.ДатаДо = ТЧ.ДатаДо;
				ОблПЗ.Параметры.ВремяИзготовления = Формат(ТЧ.ВремяИзготовления,"ЧЦ=9; ЧДЦ=2");
				ОблПЗ.Параметры.ВремяПростоя = Формат(ТЧ.ВремяПростоя,"ЧЦ=9; ЧДЦ=2");	
				ОблПЗ.Параметры.ПричиныЗадержки = ТЧ.ПричиныЗадержки; 
				ОблПЗ.Параметры.МПЗВЛО = ТЧ.МПЗВЛО;
				ОблПЗ.Параметры.ВремяИтого = Формат(ТЧ.ВремяИзготовления+ТЧ.ВремяПростоя,"ЧЦ=9; ЧДЦ=2");
				ТабДок.Вывести(ОблПЗ);
				КонецЦикла;
	ТабДок.ЗакончитьГруппуСтрок();
		Если ГруппироватьПо = 1 Тогда
		ОблИтогоЛинейка.Параметры.СреднееВремяИзготовления = ?(ТаблицаМПЗ.Количество() > 0,Формат(ТаблицаМПЗ.Итог("ВремяИзготовления")/ТаблицаМПЗ.Количество(),"ЧЦ=9; ЧДЦ=2"),0);
		ОблИтогоЛинейка.Параметры.СреднееВремяПростоя = ?(ТаблицаМПЗ.Количество() > 0,Формат(ТаблицаМПЗ.Итог("ВремяПростоя")/ТаблицаМПЗ.Количество(),"ЧЦ=9; ЧДЦ=2"),0);
		ТабДок.Вывести(ОблИтогоЛинейка);
		Иначе
		ОблИтогоНоменклатура.Параметры.СреднееВремяИзготовления = ?(ТаблицаМПЗ.Количество() > 0,Формат(ТаблицаМПЗ.Итог("ВремяИзготовления")/ТаблицаМПЗ.Количество(),"ЧЦ=9; ЧДЦ=2"),0);
		ОблИтогоНоменклатура.Параметры.СреднееВремяПростоя = ?(ТаблицаМПЗ.Количество() > 0,Формат(ТаблицаМПЗ.Итог("ВремяПростоя")/ТаблицаМПЗ.Количество(),"ЧЦ=9; ЧДЦ=2"),0);
		ТабДок.Вывести(ОблИтогоНоменклатура);		
		КонецЕсли;  
	КонецЦикла;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 2;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры
